insert into hoyo_achieve.sr_achievement (achievement_id, class, name, description, reward_level, hidden, game_version)
values  (3002001, '战意奔涌', '脆弱之身', '单场战斗中，使用我方角色银狼为同一敌方单体累计添加3次不同属性的弱点', 2, 1, '1.1'),
        (3002002, '战意奔涌', '猎手何苦为难猎手', '使用我方角色银狼在对战卡芙卡时，单场战斗中累计为卡芙卡添加2个弱点', 1, 1, '1.1'),
        (4002001, '流光遗痕', '畅聊之火', '回复10条角色闲聊短信', 1, 0, '1.1'),
        (4002002, '流光遗痕', '友谊之船', '回复60条角色闲聊短信', 1, 0, '1.1'),
        (7002001, '瞬息欢愉', '尘世百态', '使用我方角色罗刹提供治疗时，触发10句不同的回复生命语音', 1, 1, '1.1'),
        (7002002, '瞬息欢愉', '星穹折剑', '使用同时包含罗刹、素裳、彦卿的队伍配置取得1场战斗的胜利', 1, 1, '1.1'),
        (8002001, '与你同行的回忆', '完美无缺的名侦探', '完成同行任务「异邦骑士」', 1, 1, '1.1'),
        (8002002, '与你同行的回忆', '剑中魁首', '完成同行任务「霜刃一试」', 1, 1, '1.1'),
        (8002003, '与你同行的回忆', '再见，朋克洛德！', '完成同行任务「朋克洛德精神」', 1, 1, '1.1'),
        (8002004, '与你同行的回忆', '棺材舞者', '见证罗刹的不为人知的一面 ※查看修复后的影像，听到罗刹的独白', 1, 0, '1.1'),
        (8002005, '与你同行的回忆', '今日免费开放', '开启贝洛伯格历史文化博物馆的综合展区', 1, 1, '1.1'),
        (8002006, '与你同行的回忆', '猫鼠游戏', '开启贝洛伯格历史文化博物馆的三个展区', 1, 1, '1.1'),
        (8002007, '与你同行的回忆', '你应该待在博物馆里！', '收集贝洛伯格历史文化博物馆的全部展品', 2, 1, '1.1'),
        (8002008, '与你同行的回忆', '何枝可依', '在任务「譬如朝露」中，向梁沐透露魔阴身怪物的身份', 1, 1, '1.1'),
        (8002009, '与你同行的回忆', '心念旧恩', '在任务「譬如朝露」中，向梁沐隐瞒魔阴身怪物的身份', 1, 1, '1.1'),
        (9002001, '众秘探奇', '自投罗网', '累计在战斗中捕捉迷路的扑满1次', 1, 1, '1.1')
ON DUPLICATE KEY UPDATE
    achievement_id = VALUES(achievement_id);