insert into hoyo_achieve.zzz_achievement (achievement_id, class_id, name, description, reward_level, hidden, game_version)
values  (1001062, 2002, '灵感贩售处', '解锁光映广场的「3Z设计工作室」。', 1, 1, '1.3'),
        (1001063, 2002, '我全要了！', '从「3Z设计工作室」兑换5件乙的作品。', 1, 2, '1.3'),
        (1001064, 2002, '连环失窃案·协理', '在「丽都周纪」中，找回葵家的刀、海藤大叔的鱼线、尚先生的照片和多莉的滑轮装置。', 1, 1, '1.3'),
        (1001065, 2002, '连环失窃案·真相', '在「丽都周纪」中，向邻居和朋友们了解更多「猫小偷」相关的信息。', 1, 1, '1.3'),
        (1003044, 2001, '不慎斩获过多荣誉', '更换绳网称号。', 1, 0, '1.3'),
        (1004028, 1004, '红围巾之名', '莱特对绳匠的信赖达到4阶。', 1, 2, '1.3'),
        (1004029, 1004, '柳的特别关心', '月城柳对绳匠的信赖达到4阶。', 1, 2, '1.3'),
        (1006009, 1002, '烈拳困斗', '完成莱特的代理人秘闻「无人喝彩之冠」。', 2, 1, '1.3'),
        (1007003, 1003, '六课的大脑', '完成月城柳的独家视界「虚拟杀机」。', 3, 1, '1.3'),
        (2001068, 3002, '绝境逢生', '在枯萎之都中，获得过所有「顽强」类型的鸣徽。', 1, 2, '1.3'),
        (2001069, 3002, '速效救援', '在枯萎之都中，获得「顽强」类型的进阶鸣徽II。', 1, 2, '1.3'),
        (2004038, 3005, '迈出新手村！', '在「拟真鏖战试炼」中，到达第5阶层。', 1, 2, '1.3'),
        (2004039, 3005, '头号调查员', '在「拟真鏖战试炼」中，到达第25阶层。', 3, 2, '1.3'),
        (2004040, 3005, '迷宫的跨越者', '在「拟真鏖战试炼」中，通关第100阶层并完成一场在虚拟空间的会面。', 3, 1, '1.3'),
        (3001027, 4001, '空洞速降训练', '在「无底深渊」中，完成空洞第30层的探索。', 1, 2, '1.3'),
        (3002001, 4002, '渐入「佳」境', '在「断层之谜」中，队伍在探索中累计升级30次。', 1, 2, '1.3'),
        (3002002, 4002, '工业化空洞探索', '在「断层之谜」中，进行30次探索科技树的升级。', 1, 2, '1.3'),
        (3002003, 4002, '专业导览，随机应变', '在「断层之谜」中，解锁全部五种编队战略。', 2, 2, '1.3'),
        (3002004, 4002, '回廊深处的秘密', '在「断层之谜」中，完成「乱流回廊」谷底区域的探索。', 3, 2, '1.3'),
        (3002005, 4002, '迟来的礼物', '在「断层之谜」中，完成所有隐藏区域探索。', 3, 2, '1.3')
ON DUPLICATE KEY UPDATE
    achievement_id = VALUES(achievement_id);