insert into hoyo_achieve.zzz_achievement (achievement_id, class_id, name, description, reward_level, hidden, game_version)
values  (1001084, 2002, '「设计如此」', '在星环电视塔的流光大厅中，偶遇努力通关的专业设计师。', 1, 1, '1.7'),
        (1001085, 2002, '旅鸟的归巢', '在厄匹斯港的炬光灯塔上，观赏老唐的海鸥提灯。', 1, 1, '1.7'),
        (1004048, 1004, '尘埃里开花', '雨果对绳匠的信赖达到4阶。', 1, 2, '1.7'),
        (1004049, 1004, '飞鸟停落处', '薇薇安对绳匠的信赖达到4阶。', 1, 2, '1.7'),
        (1004050, 1004, '心有钢筋，细嗅蔷薇', '在「密友同行」中，分别与安东、珂蕾妲一起完成插花。', 1, 2, '1.7'),
        (1004051, 1004, '绅士的必修课', '在「密友同行」中，分别与雨果、莱卡恩一起完成插花。', 1, 2, '1.7'),
        (1004052, 1004, '芳馨盈袖', '在「密友同行」中，分别与朱鸢、星见雅一起完成插花。', 1, 2, '1.7'),
        (1005010, 1001, '飞往明日歌', '完成法厄同纪事「将眼泪与过往一同埋葬 下」。', 3, 1, '1.7'),
        (1008019, 1005, '投我以春花', '在「花语未明之言」中，选中所有代理人喜爱的花材、配饰或花盆。', 1, 2, '1.7'),
        (1008020, 1005, '这是什么？我用一下！', '在「花语未明之言」中，使用过所有的花材、配饰和花盆。', 1, 2, '1.7'),
        (1008021, 1005, '愿君多采撷', '在「花语未明之言」中，点击代理人喜爱的物件20次，并听到反应。', 1, 2, '1.7'),
        (1008022, 1005, '恭喜发财！', '在「花语未明之言」中，营业额累计达到888888丁尼。', 1, 2, '1.7'),
        (1008023, 1005, '怪盗的职业素养', '在「花语未明之言」中，发现雨果找到「尼尼微」的来源。', 1, 2, '1.7'),
        (1008024, 1005, '「菩提本无树」', '在「花语未明之言」中，只使用花盆并完成了代理人的花艺委托。', 1, 2, '1.7'),
        (1009005, 1006, '捣蛋邦布马失前蹄', '在星环电视塔的流光大厅中，目睹捣蛋邦布们被逮住。', 1, 1, '1.7'),
        (1009006, 1006, '「法厄同呀法厄同~」', '为3个代理人各装备6枚「法厄同之歌」驱动盘，完成1场战斗。', 1, 1, '1.7')
ON DUPLICATE KEY UPDATE
    achievement_id = VALUES(achievement_id);